# Завдання 2
# Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами, що випали випадковим чином і в певному діапазоні під час чергового тиражу. Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
# Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати набір унікальних випадкових чисел для таких лотерей. Вона буде повертати випадковий набір чисел у межах заданих параметрів, причому всі випадкові числа в наборі повинні бути унікальні.

import random


def get_numbers_ticket(min: int, max: int, quantity: int):
    if not (1 <= min <= max <= 1000) or not (min <= quantity <= max):
        return []  # пустий список у випадку невірних параметрів
    return sorted(random.sample(range(min, max + 1), quantity))


# генеруємо 6 випадкових чисел з 1..49
print(f"Ваші лотерейні числа: {get_numbers_ticket(1, 49, 6)}")
